/* No comment provided by engineer. */
" and %@" = " และ%@ ";

/* elapsed time on recording screen, in seconds */
"%.1f sec" = "%.1f วินาที";

/* update notice when someone comments. %1$@ is the commenter name, %2$@ is the comment. */
"%1$@ commented: %2$@" = "%1$@ได้แสดงความคิดเห็น%2$@";

/* update notice when someone suggests an ID. %1$@ is the username, %2$@ is the species. */
"%1$@ suggested an ID: %2$@" = "%1$@ แนะนำว่าเป็น: %2$@";

/* confirmation alert text when changing a users network affiliation. %1%@ is network name, %2%@ is the country, %3%@ is the network name again */
"%@ is a member of the iNaturalist Network in %@. Local institutions supporting %@ will have access to your email address and access to the true coordinates for observations that are publicly obscured or private. Would you like to change your affiliation?" = "%1$@ เป็นสมาชิกของ iNaturalist Network ใน %2$@. สถาบันในท้องถิ่นที่สนับสนุน %3$@ จะสามารถเข้าถึงที่อยู่อีเมลของคุณและเข้าถึงพิกัดที่แท้จริงสำหรับการสังเกตการณ์ที่ปิดบังต่อสาธารณะหรือส่วนตัว คุณต้องการเปลี่ยนสังกัดของคุณหรือไม่?";

/* join iNat network partner alert message - %1%@ is the country name, %2%@ is partner name */
"%@ is part of the international iNaturalist Network. Would you like to join %@ to localize your experience of iNaturalist and share data with local institutions?" = "%1$@ เป็นส่วนหนึ่งของเครือข่าย iNaturalist ระหว่างประเทศ คุณต้องการที่จะเข้าร่วม %2$@ เพื่อเสริมสร้างประสบการณ์ของคุณกับ iNaturalist และแบ่งปันข้อมูลกับสถาบันในพื้นที่?";

/* site news */
"%@ News" = "%@ ข่าวสาร";

/* identification author attribution */
"%@'s ID" = "%@'s การระบุ";

/* No comment provided by engineer. */
"%@, build %@" = "%1$@, สร้าง %2$@";

/* No comment provided by engineer. */
"%@, build %@, iOS %@" = "%1$@, สร้าง %2$@, ระบบ iOS %3$@";

/* Count of observations by this user, singular. */
"%d Observation" = "%d การสังเกต";

/* Count of observations to upload, singular. */
"%d Observation To Upload" = "%d อัปโหลดการสังเกต";

/* Count of observations by this user, plural. */
"%d Observations" = "%d การสังเกต";

/* Count of observations to upload, plural. */
"%d Observations To Upload" = "%d อัปโหลดการสังเกต";

/* format string for showing positional accuracy in meters */
"%ld m" = "%ld เมตร";

/* No comment provided by engineer. */
"'%@' requires that you fill out the '%@' field." = "'%1$@' กรุณากรอกข้อมูล '%2$@' ";

/* positional accuracy when we don't know */
"???" = "???";

/* About button title in Settings
   About project button
   about the project header
   title of about screen */
"About" = "เกี่ยวกับเรา";

/* title for about section of the guide screen */
"ABOUT" = "เกี่ยวกับเรา";

/* about this project title */
"About this Project" = "เกี่ยวกับโปรเจคนี้";

/* emphasis text for the 'switch to login mode' button. must be a substring of the base text */
"Account?" = "บัญชีผู้ใช้";

/* No comment provided by engineer. */
"Activity" = "กิจกรรมที่เกิดขึ้น";

/* Title for add comment failed alert */
"Add Comment Failure" = "เพิ่มความคิดเห็นล้มเหลว";

/* Title for add ID failed alert */
"Add Identification Failure" = "เพิ่มการจำแนกล้มเหลว";

/* No comment provided by engineer. */
"Add to Favorites" = "เพิ่มไปยังรายการโปรด";

/* Label for a button that adds an ID of the same taxon as the current one, so the sense is 'I agree with this identification' */
"Agree" = "ยอมรับ";

/* base text for the 'switch to login mode' button */
"Already have an Account?" = "มีบัญชีอยู่แล้ว?";

/* Title for app section of settings. */
"App Settings" = "การตั้งค่าแอปพลิเคชัน";

/* No comment provided by engineer. */
"Are you really sure?" = "คุณแน่ใจแล้ว?";

/* No comment provided by engineer. */
"Are you sure you want to leave this project?" = "คุณแน่ใจไหมว่าต้องการออกจากโครงการนี้?";

/* No comment provided by engineer. */
"Are you sure?" = "คุณแน่ใจหรือไม่?";

/* No comment provided by engineer. */
"Are you sure? This is permanent." = "คุณแน่ใจไหม? สิ่งนี้เป็นแบบถาวร";

/* argentina partner */
"Argentina: Fundación Vida Silvestre Argentina supporting ArgentiNat (www.argentinat.org)." = "อาร์เจนตินา: Fundación Vida Silvestre Argentina supporting ArgentiNat (www.argentinat.org).";

/* australia partner */
"Australia: Atlas of Living Australia supporting iNaturalist Australia (inaturalist.ala.org.au/)." = "ออสเตรเลีย: Atlas of Living Australia supporting iNaturalist Australia (inaturalist.ala.org.au/).";

/* Auto state for flash button in the camera. Will be padded to sit beside a flash/bolt icon. */
"Auto" = "อัตโนมัติ";

/* label for autocomplete names switch in settings */
"Autocomplete names" = "การเติมชื่ออัตโนมัติ";

/* label for auto upload switch in settings */
"Automatic upload" = "การอัปโหลดโดยอัตโนมัติ";

/* Base text for terms of service and privacy policy notice when creating an iNat account. */
"By using iNaturalist you agree to the Terms of Service and Privacy Policy." = "การใช้ iNaturalist แสดงว่าคุณยอมรับข้อกำหนดในการให้บริการและนโยบายความเป็นส่วนตัว";

/* vision assistance */
"CalTech and Cornell Tech helped develop the computer vision system that suggests identifications from photographs. We thank Grant Van Horn, Serge Belongie, and Pietro Perona for advancing the computer vision research. More information can be found at visipedia.org. Special thanks to NVIDIA for additional assistance." = "CalTech และ Cornell Tech ช่วยพัฒนาระบบทรรศนะคอมพิวเตอร์ที่แนะนำการระบุตัวตนจากภาพถ่าย เราขอขอบคุณ Grant Van Horn, Serge Belongie และ Pietro Perona สำหรับความก้าวหน้าในการวิจัยด้านทรรศนะคอมพิวเตอร์ สามารถดูข้อมูลเพิ่มเติมได้ที่ visipedia.org ขอขอบคุณ NVIDIA เป็นพิเศษสำหรับความช่วยเหลือเพิ่มเติม";

/* Title for Camera button in media picker */
"Camera" = "ถ่ายรูป";

/* accessibility label for camera shutter button */
"Camera Shutter" = "ชัตเตอร์กล้อง";

/* No comment provided by engineer. */
"Can't Add ID" = "ไม่สามารถเพิ่มรหัส";

/* No comment provided by engineer. */
"Can't Comment" = "ไม่สามารถแสดงความคิดเห็น";

/* No comment provided by engineer. */
"Can't Fave" = "ไม่สามารถบันทึกได้";

/* Error message for when we can't retrieve your observations on Explore */
"Can't search for your observations right now. Please try later." = "ไม่สามารถค้นหาการสังเกตของคุณได้ในขณะนี้ กรุณาลองใหม่ในภายหลัง";

/* canada partner */
"Canada: Canadian Wildlife Federation, the Royal Ontario Museum, NatureServe Canada, and Parks Canada operating iNaturalist Canada (inaturalist.ca)." = "แคนาดา: Canadian Wildlife Federation, the Royal Ontario Museum, NatureServe Canada, and Parks Canada operating iNaturalist Canada (inaturalist.ca).";

/* No comment provided by engineer. */
"Cancel" = "ยกเลิก";

/* Title of me header while cancellling an upload session. */
"Cancelling..." = "กำลังยกเลิก";

/* Alert message for invalid date */
"Cannot choose a date in the future." = "ไม่สามารถเลือกวันที่จากอนาคตได้";

/* Failure message */
"Cannot donate" = "ไม่สามารถบริจาคได้";

/* error when loading suggestions. %@ is the error message */
"Cannot load suggestions: %@" = "ไม่สามารถโหลดคำแนะนำ: %@";

/* Store launch failure message */
"Cannot open store" = "เปิด​ไฟล์​ไม่​ได้";

/* Failure message */
"Cannot rate" = "ไม่สามารถให้คะแนนได้";

/* No comment provided by engineer. */
"Cannot search iNaturalist.org" = "ไม่สามารถค้นหา iNaturalist.org";

/* Title of alert when the system is not configured for the user to send email */
"Cannot Send Email" = "ไม่สามารถส่งอีเมลได้";

/* No comment provided by engineer. */
"Cannot use your location" = "ไม่สามารถใช้ตำแหน่งของคุณได้";

/* Captive / cultivated button title. */
"Captive / Cultivated" = "ถูกจับ / เพาะปลูก";

/* message explaining what captive / cultivated means for iNaturalist */
"Captive / cultivated means that the organism exists where it was observed because humans intended it to be there. iNaturalist is about observing wild organisms, and our scientific data partners are not interested in observations of pets, gardens, or animals in zoos." = "ถูกจับ / เพาะปลูก หมายความว่าสิ่งมีชีวิตมีอยู่ในที่ที่สังเกตเห็นได้เพราะมนุษย์ตั้งใจให้มันอยู่ที่นั่น iNaturalist เกี่ยวกับการสังเกตสิ่งมีชีวิตในป่าและพันธมิตรด้านข้อมูลทางวิทยาศาสตร์ของเราไม่สนใจที่จะสังเกตการณ์สัตว์เลี้ยงสวนหรือสัตว์ต่างๆในสวนสัตว์";

/* title for captive selector */
"Captive?" = "ถูกจับ?";

/* casual data quality */
"Casual Grade" = "ระดับไม่เป็นทางการ";

/* label for change email address action in settings */
"Change email" = "เปลี่ยนอีเมล";

/* No comment provided by engineer. */
"Change Email" = "เปลี่ยนอีเมล";

/* No comment provided by engineer. */
"Change email address?" = "เปลี่ยนแปลงที่อยู่อีเมล";

/* accessibility label for change flash button */
"Change Flash" = "เปลี่ยนแฟลช";

/* accessibility label for flash button when mode is auto */
"Change Flash Toggle. Current state is Auto" = "เปลี่ยนสลับแฟลชสถานะปัจจุบันคืออัตโนมัติ";

/* accessibility label for flash button when mode is off */
"Change Flash Toggle. Current state is Off" = "เปลี่ยนสลับแฟลชสถานะปัจจุบันคือปิด";

/* accessibility label for flash button when mode is on */
"Change Flash Toggle. Current state is On" = "เปลี่ยนสลับแฟลชสถานะปัจจุบันคือเปิด";

/* label for change username action in settings */
"Change username" = "เปลี่ยนชื่อผู้ใช้";

/* No comment provided by engineer. */
"Change Username" = "เปลี่ยนชื่อผู้ใช้";

/* No comment provided by engineer. */
"Change username?" = "เปลี่ยนชื่อผู้ใช้ ?";

/* No comment provided by engineer. */
"Change your profile photo?" = "เปลี่ยนรูปโปรไฟล์ของคุณ";

/* Alert text for the license content checkbox during create account. */
"Check this box if you want to apply a Creative Commons Attribution-NonCommercial license to your photos. You can choose a different license or remove the license later, but this is the best license for sharing with researchers." = "เลือกช่องนี้หากคุณต้องการใช้ใบอนุญาตยอมรับสิทธิของผู้สร้างงานสร้างสรรค์เสรีและไม่ใช้เพื่อการค้า (Creative Commons Attribution-NonCommercial) กับภาพถ่ายของคุณ คุณสามารถเลือกใบอนุญาตอื่นหรือนำใบอนุญาตออกได้ในภายหลัง แต่นี่เป็นใบอนุญาตที่ดีที่สุดสำหรับการแบ่งปันกับนักวิจัย";

/* title of alert after you reset your password */
"Check your email" = "ตรวจสอบอีเมลของคุณ";

/* chile partner */
"Chile: Ministerio del Medio Ambiente supporting iNaturalist Chile (inaturalist.mma.gob.cl)." = "ชิลี: Ministerio del Medio Ambiente supporting iNaturalist Chile (inaturalist.mma.gob.cl).";

/* No comment provided by engineer. */
"Choose from library" = "เลือกจากแกลลอรี่";

/* title of inat network picker */
"Choose iNat Network" = "เลือกเครือข่าย iNat ";

/* title for project observations chooser */
"Choose Projects" = "เลือกโครงการ";

/* accessibility label for close camera button */
"Close Camera" = "ปิดกล้องถ่าย";

/* Collection type of project, which automatically collects observations into it. */
"Collection Project" = "โปรเจกต์สะสมชนิดพันธุ์";

/* colombia partner */
"Colombia: Instituto Humboldt operating Naturalista (colombia.inaturalist.org)." = "โคลอมเบีย: Instituto Humboldt operating Naturalista (colombia.inaturalist.org).";

/* No comment provided by engineer. */
"Comment" = "ความคิดเห็น";

/* label for contact support action in settings. */
"Contact support" = "ติดต่อฝ่ายสนับสนุน";

/* Title for About Content Licensing notice during signup */
"Content Licensing" = "การอนุญาตให้ใช้สิทธิ์เนื้อหา";

/* Button to copy the scientific name */
"Copy Scientific Name" = "คัดลอกชื่อวิทยาศาสตร์";

/* Title of an alert dialog you see when you try to agree with an identification but cannot due to connection issues or other errors */
"Couldn't Agree" = "ไม่เห็นด้วย";

/* Project validation error. first string is project title, second is the specific error */
"Couldn't be added to project %@. %@" = "ไม่สามารถเพิ่มลงในโครงการ %1$@. %2$@";

/* No comment provided by engineer. */
"Couldn't determine your location" = "ไม่สามารถระบุตำแหน่งของคุณ";

/* HUD text when creating a new observation from multiple photos */
"Creating Observation..." = "กำลังสร้างการสังเกต ...";

/* intro to credits section. */
"Credits" = "เครดิต";

/* Header for data quality section of obs detail */
"Data Quality" = "คุณภาพข้อมูล";

/* Title for About Data Transfer notice during signup */
"Data Transfer" = "Data Transfer";

/* No comment provided by engineer. */
"Default" = "ค่าเริ่มต้น";

/* button to  delete a locally downloaded species guide. */
"Delete download" = "ลบดาวน์โหลด";

/* No comment provided by engineer. */
"Delete Error" = "ลบข้อผิดพลาด";

/* text of delete obs button */
"Delete Observation" = "ลบการสังเกต";

/* Deletes pending sync. */
"Deletes To Sync" = "ลบเพื่อซิงค์";

/* title for description section of the guide screen */
"DESCRIPTION" = "คำอธิบาย";

/* Title for confirm new observation details view */
"Details" = "รายละเอียด";

/* Button to cancel showing tutorial screens when visiting new tabs */
"Don't Show Me Hints" = "อย่าแสดงคำแนะนำให้ฉัน";

/* label for iNaturalist donate call to action. */
"Donate to iNaturalist" = "บริจาคให้ iNaturalist";

/* No comment provided by engineer. */
"Download" = "ดาวน์โหลด";

/* title for button that allows a user to download a species guide and use it while offline. */
"Download for offline use" = "ดาวน์โหลดเพื่อใช้งานออฟไลน์";

/* No comment provided by engineer. */
"Download not available" = "ไม่สามารถดาวน์โหลดได้";

/* notice that a species guide has been downloaded from the server and can be used while offline. */
"Downloaded" = "ดาวน์โหลดแล้ว";

/* Notice when we're downloading a species guide from the server, to be used offline */
"Downloading..." = "กำลังดาวน์โหลด...";

/* ecuador partner */
"Ecuador: Instituto Nacional de Biodiversidad (INABIO) supporting iNaturalist Ecuador (ecuador.inaturalist.org)." = "เอกวาดอร์: Instituto Nacional de Biodiversidad (INABIO) supporting iNaturalist Ecuador (ecuador.inaturalist.org).";

/* The editor or author of the species guide */
"Editor" = "บรรณาธิการ";

/* message for the alert when a guide download fails, if we can't extract an error message. */
"Either there was an error on the server or the guide no longer exists." = "เกิดข้อผิดพลาดบนเซิร์ฟเวอร์หรือไม่มีคำแนะนำอีกต่อไป";

/* label for email field in settings */
"Email" = "อีเมล";

/* No comment provided by engineer. */
"Error" = "ผิดพลาด";

/* failure title when changing a setting. */
"Error changing setting." = "เกิดข้อผิดพลาดในการเปลี่ยนการตั้งค่า";

/* No comment provided by engineer. */
"Error Fetching Observations" = "เกิดข้อผิดพลาดในการเรียกข้อมูลการสังเกต";

/* error loading leaderboard title */
"Error loading leaderboard" = "เกิดข้อผิดพลาดในการโหลดลีดเดอร์บอร์ด";

/* No comment provided by engineer. */
"Explore" = "สำรวจ";

/* title of alert when a guide download fails. a localized error message provided by iOS or the server follows. */
"Failed to download guide" = "ไม่สามารถดาวน์โหลดคำแนะนำ";

/* Unknown iNat login error */
"Failed to log in to iNaturalist. Please try again." = "เข้าสู่ระบบ iNaturalist ไม่สำเร็จ กรุณาลองอีกครั้ง.";

/* title of alert when sound recording fails */
"Failed to Record" = "บันทึกไม่สำเร็จ";

/* No comment provided by engineer. */
"Failed to save guide" = "บันทึกคำแนะนำไม่สำเร็จ";

/* title of alert when sound recording setup fails */
"Failed to Setup Sound Recording" = "ไม่สามารถตั้งค่าการบันทึกเสียง";

/* No comment provided by engineer. */
"Faved" = "บันทึกแล้ว";

/* No comment provided by engineer. */
"Featured" = "แนะนำ";

/* This is an explanation for when auth token fetch fails during upload/sync. */
"Fetching an authentication token failed. Please contact help@inaturalist.org and try later." = "การเรียกข้อมูลโทเค็นการตรวจสอบความถูกต้องล้มเหลว โปรดติดต่อ help@inaturalist.org แล้วลองอีกครั้งในภายหลัง";

/* No comment provided by engineer. */
"Fetching recent observations in map area" = "เรียกข้อมูลการสังเกตล่าสุดในพื้นที่แผนที่";

/* No comment provided by engineer. */
"Fetching recent observations worldwide" = "เรียกดูการสังเกตล่าสุดทั่วโลก";

/* No comment provided by engineer. */
"Find locations named '%@'" = "Find locations named '%@'";

/* No comment provided by engineer. */
"Find my observations" = "ค้นหาการสังเกตของฉัน";

/* No comment provided by engineer. */
"Find observations near me" = "ค้นหาการสังเกตใกล้ตัวฉัน";

/* No comment provided by engineer. */
"Find organisms named '%@'" = "Find organisms named '%@'";

/* No comment provided by engineer. */
"Find people named '%@'" = "Find people named '%@'";

/* No comment provided by engineer. */
"Find projects named '%@'" = "Find projects named '%@'";

/* No comment provided by engineer. */
"Finding your location..." = "กำลังค้นหาตำแหน่งของคุณ ...";

/* finland partner */
"Finland: Finnish Museum of Naturalist History (Luomus) supporting iNaturalist Finland (https://inaturalist.laji.fi)." = "ฟินแลนด์: Finnish Museum of Naturalist History (Luomus) supporting iNaturalist Finland (https://inaturalist.laji.fi).";

/* Title for forgot password button. */
"Forgot password?" = "ลืมรหัสผ่าน?";

/* Geoprivacy button title */
"Geoprivacy" = "ความเป็นส่วนตัวของพิกัด";

/* No comment provided by engineer. */
"Go Back" = "ย้อนกลับ";

/* Button to dismiss a tutorial screen */
"Got It" = "รับทราบ";

/* greece partner */
"Greece: iSea supporting iNaturalist Greece (greece.iNaturalist.org)." = "กรีซ: iSea สนับสนุน iNaturalist ประเทศกรีซ (greece.iNaturalist.org).";

/* No comment provided by engineer. */
"Guide download error" = "ข้อผิดพลาดในการดาวน์โหลดคำแนะนำ";

/* No comment provided by engineer. */
"Guide editor must enable this feature." = "ตัวแก้ไขคำแนะนำต้องการเปิดใช้งานคุณสมบัตินี้";

/* accessibility label for guides button */
"Guides" = "คำแนะนำ";

/* Subtitle above image for guides tutorial screen */
"Guides are created and shared by the iNaturalist community" = "คำแนะนำถูกสร้างและแบ่งปันโดยชุมชน iNaturalist";

/* Title for guides tutorial screen */
"Guides are lists of species" = "คำแนะนำคือรายชื่อสายพันธุ์";

/* Title for help section of settings. */
"Help" = "ช่วยเหลือ";

/* No comment provided by engineer. */
"Here are our top suggestions:" = "นี่คือคำแนะนำยอดนิยมของเรา:";

/* personal info consent checkbox label */
"I consent to allow iNaturalist to store and process limited kinds of personal information about me in order to manage my account. Learn More" = "I consent to allow iNaturalist to store and process limited kinds of personal information about me in order to manage my account. Learn More";

/* data transfer consent checkbox label */
"I consent to allow my personal information to be transferred to the United States of America. Learn More" = "I consent to allow my personal information to be transferred to the United States of America. Learn More";

/* Title of identification failure alert */
"Identification Failed" = "การระบุตัวตนล้มเหลว";

/* Title for taxon section when adding an ID */
"Identification Taxon" = "การจำแนกทางอนุกรมวิธาน";

/* No comment provided by engineer. */
"Identifications" = "การจำแนก";

/* No comment provided by engineer. */
"Identifiers" = "ตัวบ่งชี้";

/* body of alert after you reset your password */
"If the email address you entered is associated with an iNaturalist account, you should receive an email at that address with a link to reset your password." = "หากที่อยู่อีเมลที่คุณป้อนเชื่อมโยงกับบัญชี iNaturalist คุณควรได้รับอีเมลตามที่อยู่นั้นพร้อมลิงก์สำหรับรีเซ็ตรหัสผ่านของคุณ";

/* message of alert when mic permission is missing */
"If you wish to record a sound observation, you will need to give the iNaturalist app permission to use the microphone." = "หากคุณต้องการบันทึกการสังเกตเสียงคุณจะต้องให้สิทธิ์แอปพลิเคชัน iNaturalist ในการใช้ไมโครโฟน";

/* Message when we can't make the image store for the app */
"ImageStore Creation Error" = "ข้อผิดพลาดในการสร้างคลังภาพ";

/* Message when we can't save to the app image store */
"ImageStore Save Error" = "การบันทึกคลังภาพล้มเหลว";

/* No comment provided by engineer. */
"in project '%@'" = "ในโครงการ '%@'";

/* alert title for camera denied */
"iNaturalist doesn't have permission to access your camera." = "iNaturalistไม่ได้รับอนุญาตให้เข้าถึงตำแหน่งกล้องของคุณ";

/* inat core team, alphabetically */
"iNaturalist exists thanks to every single person who participates in our community. The people who build the software, design the interfaces, maintain our infrastructure, support the community, and foster collaborations are Yaron Budowski, Amanda Bullington, Tony Iwane, Patrick Leary, Scott Loarie, Abhas Misraraj, Carrie Seltzer, Alex Shepard, and Ken-ichi Ueda." = "iNaturalist ต้องขอบคุณทุกคนที่มีส่วนร่วมในชุมชนของเรา ผู้ที่สร้างซอฟต์แวร์ออกแบบอินเทอร์เฟซดูแลโครงสร้างพื้นฐานของเราสนับสนุนชุมชนและส่งเสริมการทำงานร่วมกัน ได้แก่ Yaron Budowski, Amanda Bullington, Tony Iwane, Patrick Leary, Scott Loarie, Abhas Misraraj, Carrie Seltzer, Alex Shepard และ Ken-ichi Ueda";

/* alert title for camera restricted */
"iNaturalist has been restricted from camera access." = "iNaturalist ถูกจำกัดสิทธิ์การเข้าถึงกล้องถ่ายภาพ";

/* inat joint initiative statement */
"iNaturalist is a joint initiative of the California Academy of Sciences and the National Geographic Society" = "iNaturalist เป็นความคิดริเริ่มร่วมกันของ California Academy of Sciences และ National Geographic Society";

/* label for inaturalist network action in settings */
"iNaturalist Network" = "เครือข่าย iNaturalist ";

/* Category of iNaturalist places for place search */
"iNaturalist Places" = "สถานที่ของ iNaturalist ";

/* open source contributions */
"iNaturalist uses Glyphish icons by Joseph Wain, ionicons by Ben Sperry, and icons by Luis Prado and Roman Shlyakov from the Noun Project. iNaturalist is also deeply grateful to the Cocoapods community, and to the contributions of our own open source community. See https://github.com/inaturalist/INaturalistIOS." = "iNaturalist ใช้ไอคอนเชิงพาณิชย์ โดย Joseph Wain, ionicons โดย Ben Sperry และไอคอนโดย Luis Prado และ Roman Shlyakov จาก Noun Project iNaturalist ยังรู้สึกขอบคุณอย่างสุดซึ้งต่อชุมชน Cocoapods และการมีส่วนร่วมของชุมชนโอเพ่นซอร์สของเราเอง ดูที่ https://github.com/inaturalist/INaturalistIOS.";

/* Error msg when we get a 401 from the server */
"Incorrect username or password." = "ชื่อ​ผู้​ใช้​หรือ​รหัส​ผ่าน​ไม่​ถูก​ต้อง";

/* No comment provided by engineer. */
"Internet connection required" = "ต้องการการเชื่อมต่ออินเทอร์เน็ต";

/* No comment provided by engineer. */
"Internet required" = "ต้องใช้อินเทอร์เน็ต";

/* title of autoupload introduction alert view */
"Introducing Auto Upload!" = "ขอแนะนำการอัปโหลดอัตโนมัติ!";

/* Invalid date alert title */
"Invalid Date" = "วันที่ไม่ถูกต้อง";

/* Error for bad email when making account. */
"Invalid Email Address" = "ที่อยู่อีเมลไม่ถูกต้อง";

/* Unknown invalid input */
"Invalid input" = "ข้อมูลที่ป้อนไม่ถูกต้อง";

/* No comment provided by engineer. */
"Invalid Location" = "สถานที่ไม่ถูกต้อง";

/* Error for bad username when making account. */
"Invalid Username" = "ชื่อผู้ใช้ไม่ถูกต้อง";

/* israel partner */
"Israel: University of Haifa supporting iNaturalist Israel (israel.inaturalist.org)." = "อิสราเอล: University of Haifa supporting iNaturalist Israel (israel.inaturalist.org).";

/* iucn places credit */
"IUCN category II places provided by IUCN and UNEP-WCMC (2015), The World Database on Protected Areas (WDPA) [On-line], [11/2014], Cambridge, UK: UNEP-WCMC. Available at: www.protectedplanet.net." = "IUCN category II places provided by IUCN and UNEP-WCMC (2015), The World Database on Protected Areas (WDPA) [On-line], [11/2014], Cambridge, UK: UNEP-WCMC. Available at: www.protectedplanet.net.";

/* Join project button */
"Join" = "เข้าร่วม";

/* join iNat network partner alert title */
"Join %@?" = "เข้าร่วม %@?";

/* Subtitle above image for projects tutorial screen */
"Join projects to select them when you record observations" = "เข้าร่วมโครงการที่เลือกเมื่อคุณบันทึกการสังเกต";

/* No comment provided by engineer. */
"Joined" = "เข้าร่วมแล้ว";

/* No comment provided by engineer. */
"Joining..." = "กำลังเข้าร่วม...";

/* visualization of latitude/longitude/accuracy */
"Lat: %.5f Long: %.5f Acc: %@" = "Lat: %1$.5f Long: %2$.5f Acc: %3$@";

/* format string for showing latitude, longitude, & positional accuracy */
"Lat: %1$@, Long: %2$@, Acc: %3$@" = "Lat: %1$@, Long: %2$@, Acc: %3$@";

/* Title for leaderboard page. */
"Leaderboard" = "กระดานคะแนน";

/* learn more (about network partner changes) button text */
"Learn more" = "เรียนรู้เพิ่มเติม";

/* No comment provided by engineer. */
"Learn more about data quality >" = "เรียนรู้เพิ่มเติมเกี่ยวกับคุณภาพข้อมูล";

/* Leave project button */
"Leave" = "ออก";

/* No comment provided by engineer. */
"Leaving..." = "กำลังออก...";

/* The license of the species guide */
"License" = "ใบอนุญาต";

/* No comment provided by engineer. */
"Loading..." = "กำลังโหลด...";

/* No comment provided by engineer. */
"Location Fetch Error" = "ต่ำแหน่งที่ตั้งผิด";

/* No comment provided by engineer. */
"Location Services Denied" = "บริการระบุตำแหน่งถูกปฏิเสธ";

/* No comment provided by engineer. */
"Location Services Restricted" = "บริการตำแหน่งถูกจำกัด";

/* Title for button that allows users to log in to their existing iNat account */
"Log In" = "เข้าสู่ระบบ";

/* No comment provided by engineer. */
"Log In / Sign Up" = "เข้าสู่ระบบ/ลงทะเบียน";

/* No comment provided by engineer. */
"Log in and upload this observation to enable comments & identifications." = "เข้าสู่ระบบและอัปโหลดข้อสังเกตนี้เพื่อเปิดใช้งานความคิดเห็นและการระบุตัวตน";

/* No comment provided by engineer. */
"Log in to enable faves." = "เข้าสู่ระบบเพื่อเปิดใช้งานการบันทึก";

/* placeholder text for taxon search bar */
"Look up a species by name" = "ค้นหาสายพันธุ์ตามชื่อ";

/* unknown taxon subtitle when suggestions are unavailable */
"Look up species name" = "ค้นหาชื่อสายพันธุ์";

/* No comment provided by engineer. */
"Looks like there was an error: %@" = "ดูเหมือนว่าจะมีข้อผิดพลาด: %@";

/* Notice to display to the user on the Me tab when they have no observations */
"Looks like you have no observations." = "ดูเหมือนคุณจะไม่มีการสังเกต";

/* label for app store rating action in settings. */
"Love iNat? Rate us" = "ชอบ LiveCap? ให้คะแนนพวกเรา!";

/* luxembourg partner */
"Luxembourg: Luxembourg National Museum of Natural History (MnhnL) supporting iNaturalist Luxembourg (inaturalist.lu)." = "ลักเซมเบิร์ก: พิพิธภัณฑ์ประวัติศาสตร์ธรรมชาติแห่งชาติลักเซมเบิร์ก (MnhnL) สนับสนุน iNaturalist Luxembourg (inaturalist.lu)";

/* No comment provided by engineer. */
"Make sure iNat has permission to access your location or give the GPS some time to fetch it." = "ตรวจสอบให้แน่ใจว่า iNat ได้รับอนุญาตให้เข้าถึงตำแหน่งของคุณหรือให้เวลา GPS ในการดึงข้อมูล";

/* title for action sheet allowing user to delete a locally downloaded guide. */
"Manage download" = "จัดการดาวน์โหลด";

/* No comment provided by engineer. */
"Map of Observations" = "แผนที่การสังเกตการณ์";

/* Placeholder text for not logged title on me tab. */
"Me" = "ฉัน";

/* mexico partner */
"Mexico: Comisión nacional para el conocimiento y uso de la biodiversidad (CONABIO) operating NaturaLista (NaturaLista.mx)." = "เม็กซิโก: Comisión nacional para el conocimiento y uso de la biodiversidad (CONABIO) operating NaturaLista (NaturaLista.mx).";

/* Title for alert when db migration fails. */
"Migration Failed" = "การย้ายข้อมูลล้มเหลว";

/* Title for alert when db migration had a problem. */
"Migration Problem" = "ปัญหาการย้ายข้อมูล";

/* No comment provided by engineer. */
"Missing Date" = "ไม่มีวันที่";

/* No comment provided by engineer. */
"Missing Location" = "ไม่มีตำแหน่งที่ตั้ง";

/* No comment provided by engineer. */
"Missing Required Field" = "ไม่มีฟิลด์ที่จำเป็น";

/* No comment provided by engineer. */
"My Content" = "เนื้อหาของคุณ";

/* No comment provided by engineer. */
"named '%@ (%@)'" = "ชื่อ '%1$@ (%2$@)'";

/* No comment provided by engineer. */
"named '%@'" = "ชื่อ '%@'";

/* No comment provided by engineer. */
"Nearby" = "ใกล้เคียง";

/* No comment provided by engineer. */
"Nearby Suggestions Filter" = "คำแนะนำใกล้เคียงตัวกรอง";

/* needs id data quality */
"Needs ID" = "ต้องการการระบุจำแนก";

/* subtitle for an observation that failed validation. */
"Needs Your Attention" = "ต้องการความสนใจของคุณ ...";

/* Network (i.e. an Internet connection) is required error message */
"Network is required." = "จำเป็นต้องมีเครือข่าย";

/* No comment provided by engineer. */
"Network unavailable" = "เครือข่ายไม่พร้อมใช้งาน";

/* No comment provided by engineer. */
"Network Unavailable" = "เครือข่ายไม่พร้อมใช้งาน";

/* decline to change cemra permissions button title */
"Never mind" = "ไม่เป็นไร.";

/* base text for the 'switch to signup mode' button */
"New to iNaturalist? Sign up now!" = "ยังใหม่กับ iNaturalist หรือไม่? สมัครตอนนี้เลย!";

/* nz partner */
"New Zealand: New Zealand Biodiversity Recording Network operating iNaturalist NZ — Mātaki Taiao (inaturalist.nz)." = "นิวซีแลนด์: New Zealand Biodiversity Recording Network operating iNaturalist NZ — Mātaki Taiao (inaturalist.nz).";

/* News project button */
"News" = "ข่าวสาร";

/* Confirm a new photo */
"NEXT" = "ถัดไป";

/* Generic negative response to a yes/no question
   negative response to binary choice, yes or no */
"No" = "ไม่";

/* No comment provided by engineer. */
"No description" = "ไม่มีคำอธิบาย";

/* No comment provided by engineer. */
"No iNaturalist Results" = "ไม่มีผลลัพธ์ของ iNaturalist";

/* place guess when we have no location information */
"No location" = "ไม่​มี​ตำแหน่ง";

/* No comment provided by engineer. */
"No matching taxa" = "ไม่มีอันดับทางอนุกรมวิธานที่ตรงกัน";

/* title of alert when user tries to record a sound observation without granting mic permissions */
"No Microphone Permissions" = "ไม่มีการอนุญาตสิทธิ์ในการเข้าถึงไมโครโฟน";

/* No comment provided by engineer. */
"No network connection." = "ไม่มีการเชื่อมต่อเครือข่าย.";

/* No comment provided by engineer. */
"No network connection. :(" = "ไม่มีการเชื่อมต่อเครือข่าย :(";

/* Header observation count title when there are none. */
"No Observations" = "ไม่มีการสังเกต";

/* Error notice when exploring observations, when no obserations were found within a map area. */
"No observations found in map area." = "ไม่พบการสังเกตในบริเวณแผนที่นี้";

/* Error notice when exploring observations when no observations were found. */
"No observations found." = "ไม่พบการสังเกต";

/* No comment provided by engineer. */
"No observations yet." = "ยังไม่มีการสังเกต";

/* accessibility label for no photo button
   Title for No Photo button in media picker */
"No Photo" = "ไม่มีภาพถ่าย";

/* No comment provided by engineer. */
"No Photos or Sounds and Missing Identification" = "ไม่มีรูปถ่ายหรือเสียงและการระบุตัวตนที่ขาดหายไป";

/* No comment provided by engineer. */
"No such organisms found. :(" = "ไม่พบสิ่งมีชีวิตดังกล่าว :(";

/* No comment provided by engineer. */
"No such person found. :(" = "ไม่พบบุคคลดังกล่าว :(";

/* No comment provided by engineer. */
"No such place found. :(" = "ไม่พบสถานที่ดังกล่าว :(";

/* No comment provided by engineer. */
"No such project found. :(" = "ไม่พบโครงการดังกล่าว :(";

/* No comment provided by engineer. */
"No Thanks" = "ไม่ล่ะ ขอบคุณ";

/* No comment provided by engineer. */
"No updates yet. Stay tuned!" = "ยังไม่มีการอัปเดต คอยติดตาม!";

/* No comment provided by engineer. */
"No URL configured" = "ไม่ได้กำหนดค่า URL";

/* do not change network partner button */
"No, don’t change my affiliation" = "ไม่อย่าเปลี่ยนความเกี่ยวข้องของฉัน";

/* Title for no photo button in the camera when making a new observation. Can support two very short lines of text. */
"NO\nPHOTO" = "ไม่มีรูปภาพ";

/* No comment provided by engineer. */
"None, all rights reserved" = "ไม่มีสงวนลิขสิทธิ์";

/* No comment provided by engineer. */
"Not Allowed" = "ไม่อนุญาต";

/* 403 unauthorized title */
"Not Authorized" = "ไม่ได้รับอนุญาต";

/* Placeholder for observation notes when making a new observation. */
"Notes..." = "หมายเหตุ ...";

/* Observation option for explore leaderboard sorting. Must be short. */
"Obs" = "Obs";

/* obscured geoprivacy */
"Obscured" = "คลุมเครือ";

/* Project validation error, with the specific error */
"Observation Field Validation error: %@" = "ข้อผิดพลาดในการตรวจสอบฟิลด์การสังเกต: %@";

/* No comment provided by engineer. */
"Observations" = "การสังเกต";

/* observation count on the explore leaderboard. */
"Observations: %ld" = "การสังเกต: %ld";

/* observation count on explore leaderboard when the user has species but not observations in the leaderboard. */
"Observations: *" = "การสังเกต: *";

/* Title for New Observation Tab Bar Button */
"Observe" = "การสังเกต";

/* No comment provided by engineer. */
"Observers" = "ผู้สังเกต";

/* Off state for flash button in the camera. Will be padded to sit beside a flash/bolt icon. */
"Off" = "ปิด";

/* No comment provided by engineer. */
"OK" = "ตกลง";

/* On state for flash button in the camera. Will be padded to sit beside a flash/bolt icon. */
"On" = "เปิด";

/* Title error with oops text. */
"Oops" = "อุ๊บส์";

/* open geoprivacy */
"Open" = "เปิด";

/* No comment provided by engineer. */
"Open link in Safari" = "เปิดโดย Safari";

/* button to open settings when user needs to adjust mic permissions
   open settings button title */
"Open Settings" = "เปิดการตั้งค่า";

/* panama partner */
"Panama: Ministerio de Ambiente operating iNaturalistPa (panama.inaturalist.org)." = "ปานามา : Ministerio de Ambiente operating iNaturalistPa (panama.inaturalist.org).";

/* Error for bad password when making account */
"Passwords must be at least six characters in length." = "รหัสผ่านต้องมีอย่างน้อย 6 ตัวอักษร";

/* Accessibility Label for Pause Button (when recording audio) */
"Pause" = "หยุดชั่วคราว";

/* No comment provided by engineer. */
"Paused" = "หยุดชั่วคราว";

/* No comment provided by engineer. */
"Permission denied" = "สิทธิ์การใช้งานถูกปฏิเสธ!";

/* Title for About Personal Information notice during signup */
"Personal Information" = "Personal Information";

/* Title for Photo Library button in media picker */
"Photo Library" = "คลังรูปถ่าย";

/* Title for photo library error when making new obs
   Title for photo library fetch error when making new obs
   Title for photo load error alert msg */
"Photo Load Error" = "ข้อผิดพลาดในการโหลดรูปภาพ";

/* Title for photo save error alert msg */
"Photo Save Error" = "ข้อผิดพลาดในการบันทึกรูปภาพ";

/* Title for photos error alert msg */
"Photos Error" = "ข้อผิดพลาดของรูปภาพ";

/* accessibility label for pick from library button */
"Pick from Library" = "เลือกจากคลัง";

/* No comment provided by engineer. */
"Placeholder" = "ตัวยึดตำแหน่ง";

/* helpful note about observations and collection projects on the screen where you can add observations to projects. */
"Please note: Observations will be automatically included in a collection project if they meet its requirements." = "โปรดทราบ: การสังเกตการณ์จะรวมอยู่ในโครงการรวบรวมโดยอัตโนมัติหากเป็นไปตามข้อกำหนด";

/* No comment provided by engineer. */
"Please pick a valid location." = "โปรดเลือกสถานที่ที่ถูกต้อง";

/* Error message for the user, when the geocoder is telling us to slow down. */
"Please try again in a few moments." = "โปรดลองอีกครั้งในอีกสักครู่.";

/* failure message when the user should just try again. */
"Please try again later." = "กรุณาลองใหม่อีกครั้งในภายหลัง.";

/* alert msg to change camera permissions */
"Please update camera permissions to take photos with iNaturalist" = "กรุณาตรอจสอบสิทธิ์การเข้าถึงกล้องเพื่อใช้ถ่ายภาพด้วย iNaturalist ";

/* No comment provided by engineer. */
"Please upload to determine data quality" = "โปรดอัปโหลดเพื่อตรวจสอบคุณภาพของข้อมูล";

/* portugal partner */
"Portugal: Associação Biodiversidade Para Todos operating Biodiversity4All (Biodiversity4All.org)." = "โปรตุเกส: Associação Biodiversidade Para Todos operating Biodiversity4All (Biodiversity4All.org).";

/* label for a news post author */
"Posted by" = "โพสต์โดย";

/* label for prefer no tracking switch in settings */
"Prefer No Tracking" = "ไม่ต้องการติดตาม";

/* Emphasized part of the privacy base text. */
"Privacy Policy" = "นโยบายความเป็นส่วนตัว";

/* private geoprivacy */
"Private" = "ส่วนบุคคล";

/* choose projects button title. */
"Projects" = "โครงการทั้งหมด";

/* Title for projects tutorial screen */
"Projects are collections of observations with a common purpose" = "โครงการทั้งหมดคือกลุ่มของการสังเกตโดยมีวัตถุประสงค์ร่วมกัน";

/* No comment provided by engineer. */
"Pull to Refresh" = "ลากลงเพื่อรีเฟรช";

/* Rank in an ordered list */
"Rank" = "อันดับ";

/* action to re-download a species guide from the server */
"Re-download" = "ดาวน์โหลดอีกครั้ง";

/* Accessibility Label for Record Button (when recording audio)
   Accessibility Label for Record/Pause Button */
"Record" = "บันทึก";

/* Title for Camera button in media picker */
"Record Sound" = "บันทึกเสียง";

/* Accessibility label for sound recorder */
"Recording Level (from 0 to 1)" = "ระดับการบันทึก (จาก 0 ถึง 1)";

/* Title for sound recording screen */
"Recording Sound" = "บันทึกเสียง";

/* No comment provided by engineer. */
"Remove my profile photo" = "ลบรูปโปรไฟล์ของฉัน";

/* No comment provided by engineer. */
"Removing..." = "กำลังลบ ...";

/* No comment provided by engineer. */
"RESEARCH" = "งานวิจัย";

/* research data quality */
"Research Grade" = "ระดับของงานวิจัย";

/* No comment provided by engineer. */
"Restricted to current map area" = "จำกัดเฉพาะพื้นที่แผนที่ปัจจุบัน";

/* No comment provided by engineer. */
"Resuming" = "กำลังดำเนินการต่อ";

/* Retake a photo */
"RETAKE" = "ถ่ายอีกครั้ง";

/* accessibility label for reverse/switch camera button */
"Reverse Camera" = "กลับด้านกล้อง";

/* Title for save new observation button */
"SAVE" = "บันทึก";

/* No comment provided by engineer. */
"Save Anyway" = "บันทึกต่อไป";

/* Done button for recording observation sounds */
"Save Recording" = "บันทึกการบันทึก";

/* No comment provided by engineer. */
"Saving..." = "กำลังบันทึก...";

/* No comment provided by engineer. */
"Search" = "ค้นหา";

/* placeholder for guide search field */
"Search for guide named..." = "ค้นหาชื่อแนะนำ ...";

/* placeholder for project search field */
"Search for project named..." = "ค้นหาโครงการชื่อ ...";

/* No comment provided by engineer. */
"Searching for organisms..." = "กำลังค้นหาสิ่งมีชีวิต ...";

/* No comment provided by engineer. */
"Searching for people..." = "กำลังค้นหาบุคคล ...";

/* No comment provided by engineer. */
"Searching for place..." = "กำลังค้นหาสถานที่ ...";

/* No comment provided by engineer. */
"Searching for project..." = "กำลังค้นหาโครงการ ...";

/* No comment provided by engineer. */
"Searching for recent observations in map area" = "กำลังค้นหาการสังเกตล่าสุดในพื้นที่แผนที่";

/* No comment provided by engineer. */
"Searching for recent observations worldwide" = "กำลังค้นหาการสังเกตล่าสุดทั่วโลก";

/* No comment provided by engineer. */
"seen at '%@'" = "เห็นที่ '%@'";

/* No comment provided by engineer. */
"seen by '%@'" = "เห็นโดย '%@'";

/* basis for a suggestion */
"Seen Nearby" = "เห็นในบริเวณใกล้เคียง";

/* default select title */
"Select" = "เลือก";

/* select taxon title */
"Select \"%@\"" = "เลือก \"%@\"";

/* title for date selector */
"Select Date" = "เลือกวันที่";

/* title for geoprivacy selector */
"Select Privacy" = "เลือกความเป็นส่วนตัว";

/* No comment provided by engineer. */
"Selected Observation" = "การสังเกตที่เลือก";

/* accessibility label for choose profile photo button */
"Set Profile Photo" = "ตั้งค่ารูปโปรไฟล์";

/* Notice while we're setting up an iNat account for them */
"Setting up iNaturalist account..." = "กำลังตั้งค่าบัญชี iNaturalist ...";

/* accessibility label for settings button
   Title for the settings screen. */
"Settings" = "การตั้งค่า";

/* Title for share new observation button */
"SHARE" = "แชร์";

/* Prompt to sign in on the Me tab header. */
"Share your observations with the community." = "แบ่งปันการสังเกตของคุณกับชุมชน";

/* label for iNaturalist store (tshirts/etc) action in settings. */
"Shop the iNat Store" = "ร้านค้าที่ iNat Store";

/* label for show common names switch in settings */
"Show common names" = "แสดงชื่อสามัญ";

/* No comment provided by engineer. */
"Show nearby suggestions only" = "แสดงคำแนะนำในบริเวณใกล้เคียงเท่านั้น";

/* label for scientific names shown first switch in settings */
"Show scientific names first" = "แสดงชื่อวิทยาศาสตร์ก่อน";

/* No comment provided by engineer. */
"Sign out" = "ออกจากระบบ";

/* Title for button that allows users to sign up for a new iNat account */
"Sign Up" = "ลงทะเบียน";

/* emphasis text for the 'switch to signup mode' button. must be a substring of the base text */
"Sign up now!" = "สมัครเดียวนี้!";

/* No comment provided by engineer. */
"Signing Out" = "กำลังออกจากระบบ";

/* skip button title */
"Skip ›" = "ข้าม";

/* Alert text for the data transfer consent checkbox during create account. */
"Some data privacy laws, like the European Union's General Data Protection Regulation (GDPR), require explicit consent to transfer personal information from their jurisdictions to other jurisdictions where the legal protection of this information is not considered adequate. As of 2020, the European Union no longer considers the United States to be a jurisdiction that provides adequate legal protection of personal information, specifically because of the possibility of the US government surveilling data entering the US. It is possible other jurisdictions may have the same opinion. Using iNaturalist requires the storage of personal information like your email address, all iNaturalist data is stored in the United States, and we cannot be sure what legal jurisdiction you are in when you are using iNaturalist, so in order to comply with privacy laws like the GDPR, you must acknowledge that you understand and accept this risk and consent to transferring your personal information to iNaturalist's servers in the US. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account." = "Some data privacy laws, like the European Union's General Data Protection Regulation (GDPR), require explicit consent to transfer personal information from their jurisdictions to other jurisdictions where the legal protection of this information is not considered adequate. As of 2020, the European Union no longer considers the United States to be a jurisdiction that provides adequate legal protection of personal information, specifically because of the possibility of the US government surveilling data entering the US. It is possible other jurisdictions may have the same opinion. Using iNaturalist requires the storage of personal information like your email address, all iNaturalist data is stored in the United States, and we cannot be sure what legal jurisdiction you are in when you are using iNaturalist, so in order to comply with privacy laws like the GDPR, you must acknowledge that you understand and accept this risk and consent to transferring your personal information to iNaturalist's servers in the US. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account.";

/* No comment provided by engineer. */
"Somewhere..." = "บางที่...";

/* Label for the sort selector in the explore leaderboard header. */
"Sort" = "จัดเรียง";

/* credit for the wikipedia snippet that we include in inat taxon pages. first substitution is the article name, the second substitution is the license name. */
"Source: Wikipedia, %1$@, %2$@" = "ที่มา: Wikipedia, %1$@, %2$@";

/* Species option for Explore leaderboard sorting. Must be short. */
"Species" = "ชนิด";

/* species count on the explore leaderboard. */
"Species: %ld" = "ชนิด: %ld";

/* observation count on explore leaderboard when the user has observations but not species in the leaderboard. */
"Species: *" = "ชนิด: *";

/* Title for button in the explore tab that leads to the stats leaderboard. */
"Stats" = "สถิติ";

/* accessibility label for stop uploading button */
"Stop Uploading" = "หยุดการอัปโหลด";

/* No comment provided by engineer. */
"Suggest ID" = "การจำแนกที่ได้รับการแนะนำ";

/* label for suggest species switch in settings */
"Suggest species" = "ชนิดที่ได้รับการแนะนำ";

/* No comment provided by engineer. */
"Suggestions based on observations and identifications provided by the iNaturalist community, including %@, %@, %@, and many others." = "ข้อเสนอแนะตามการสังเกตและการระบุโดยชุมชน iNaturalist รวมถึง %1$@, %2$@, %3$@ และอื่น ๆ อีกมากมาย";

/* No comment provided by engineer. */
"Suggestions based on observations and identifications provided by the iNaturalist community." = "ข้อเสนอแนะตามการสังเกตและการระบุโดยชุมชน iNaturalist";

/* Title of me header when syncing. */
"Syncing..." = "กำลังซิงค์...";

/* Category of iOS standard places for place search */
"System Places" = "สถานที่ของระบบ";

/* Tags (kind of like categories) are applied to the species in a guide, and allow the guide editor to group and organize the species in a guide. */
"TAGS" = "TAGS";

/* No comment provided by engineer. */
"Take a photo" = "ถ่ายภาพ";

/* Title for description/comment when adding an ID */
"Tell Us Why" = "บอกเหตุผลให้เราทราบ";

/* Emphasized part of the terms of service base text. */
"Terms of Service" = "เงื่อนไขการให้บริการ";

/* No comment provided by engineer. */
"There are no observations for this project yet. Check back soon!" = "ยังไม่มีการสังเกตสำหรับโครงการนี้ กลับมาตรวจสอบเร็ว ๆ นี้!";

/* Error for no data transfer consent consent when making account. */
"There is no way to have an iNaturalist account without storing personal information in the United States." = "There is no way to have an iNaturalist account without storing personal information in the United States.";

/* Error for no personal info consent when making account. */
"There is no way to have an iNaturalist account without storing personal information." = "There is no way to have an iNaturalist account without storing personal information.";

/* Unresolvable and unknown error during observation upload. */
"There was an unexpected error." = "ขออภัย เกิดข้อผิดพลาดที่ไม่คาดคิด";

/* No comment provided by engineer. */
"This observation has been voted as Casual Grade by the iNaturalist community." = "ข้อสังเกตนี้ได้รับการโหวตให้เป็นระดับไม่เป็นทางการโดยชุมชน iNaturalist";

/* No comment provided by engineer. */
"This observation is Casual Grade because it has been voted captive or cultivated by the iNaturalist community." = "ข้อสังเกตนี้เป็นระดับไม่เป็นทางการเนื่องจากได้รับการโหวตให้เป็นถูกเลี้ยงหรือถูกเพาะพันธุ์โดยชุมชน iNaturalist";

/* No comment provided by engineer. */
"This observation needs a date to be considered for Research Grade." = "การสังเกตนี้จำเป็นต้องมีวันที่ที่จะได้รับการพิจารณาสำหรับระดับการวิจัย";

/* No comment provided by engineer. */
"This observation needs a location to be considered for Research Grade." = "การสังเกตนี้จำเป็นต้องมีสถานที่ที่จะได้รับการพิจารณาสำหรับระดับการวิจัย";

/* No comment provided by engineer. */
"This observation needs a more specific consensus ID to be considered for Research Grade." = "การสังเกตนี้จำเป็นต้องมี ID ฉันทามติที่เฉพาะเจาะจงมากขึ้นเพื่อใช้ในการพิจารณาระดับการวิจัย";

/* No comment provided by engineer. */
"This observation needs a photo to be considered for Research Grade." = "การสังเกตนี้จำเป็นต้องใช้ภาพถ่ายเพื่อพิจารณาระดับการวิจัย";

/* No comment provided by engineer. */
"This observation needs more IDs from the iNat community to be considered for Research Grade." = "การสังเกตนี้ต้องการการระบุเพิ่มเติมจากชุมชน iNat เพื่อใช้ในการพิจารณาระดับการวิจัย";

/* No comment provided by engineer. */
"This project has no description." = "โครงการนี้ยังไม่มีคำอธิบาย";

/* No comment provided by engineer. */
"This project has no title." = "โครงการนี้ยังไม่มีชื่อเรื่อง";

/* No comment provided by engineer. */
"This will also remove your observations from this project." = "การดำเนินการนี้จะลบข้อสังเกตของคุณออกจากโครงการนี้ด้วย";

/* No comment provided by engineer. */
"This will destroy any changes/additions you've made from this app that haven't been synced with iNaturalist.org." = "สิ่งนี้จะทำลายการเปลี่ยนแปลง / เพิ่มเติมใด ๆ ที่คุณได้ทำจากแอพนี้ที่ยังไม่ได้ซิงค์กับ iNaturalist.org";

/* No comment provided by engineer. */
"This will download %@ of data so you can use this guide even when you don't have Internet access." = "การดำเนินการนี้จะดาวน์โหลด %@ ของข้อมูลเพื่อให้คุณสามารถใช้คู่มือนี้ได้แม้ว่าคุณจะไม่มีอินเทอร์เน็ตก็ตาม";

/* Label for the time period selector in the explore leaderboard header. */
"Time Period" = "ช่วงเวลา";

/* No comment provided by engineer. */
"Timeout" = "หมดเวลา";

/* project title header */
"Title" = "หัวข้อ";

/* Traditional inat type of project, where users have to manually add observations to the project. */
"Traditional Project" = "โปรเจกต์แบบดั้งเดิม";

/* No comment provided by engineer. */
"Try again next time you're connected to the Internet." = "ลองอีกครั้งในครั้งต่อไปที่คุณเชื่อมต่อกับอินเทอร์เน็ต";

/* button title to turn on autoupload */
"Turn On" = "เปิด";

/* message of autoupload introduction alert view */
"Turn on Auto Upload and your observations will be automatically uploaded to iNaturalist." = "เปิดการอัปโหลดอัตโนมัติและการสังเกตของคุณจะถูกอัปโหลดไปยัง iNaturalist โดยอัตโนมัติ";

/* Umbrella type of project, which contains other projects within it. */
"Umbrella Project" = "ชุดโครงการ ";

/* Failure message when making an identification */
"Unable to add an identification to this observation. Please try again later." = "ไม่สามารถเพิ่มข้อมูลประจำตัวให้กับข้อสังเกตนี้ กรุณาลองใหม่อีกครั้งในภายหลัง.";

/* No comment provided by engineer. */
"Unable to find location" = "ไม่สามารถรับตำแหน่ง";

/* place guess when we have lat/lng but it's not geocoded */
"Unable to find location name" = "ไม่พบชื่อสถานที่";

/* Failure message when making an identification */
"Unable to identify this observation to that species. Please try again later." = "ไม่สามารถระบุชนิดจากการสังเกตนั้นได้ กรุณาลองใหม่อีกครั้ง";

/* This is an explanation for when we get a 401 during upload/sync. */
"Unable to upload to iNaturalist, error 401 unauthenticated. Please contact help@inaturalist.org and try later." = "ไม่สามารถอัปโหลดไปยัง iNaturalist ข้อผิดพลาด 401 ไม่ได้รับการตรวจสอบสิทธิ์ โปรดติดต่อ help@inaturalist.org แล้วลองอีกครั้งในภายหลัง";

/* uk partner */
"United Kingdom: National Biodiversity Network Trust supporting iNaturalist United Kingdom (uk.inaturalist.org)." = "สหราชอาณาจักร: National Biodiversity Network Trust ผู้ให้การสนับสนุน iNaturalist ในสหราชอาณาจักร (uk.inaturalist.org)";

/* unknown taxon */
"Unknown" = "ไม่ทราบ";

/* Text shown in place of a post author when a post has no known author */
"Unknown author" = "ผู้เขียนที่ไม่รู้จัก";

/* Message body when we don't know the error */
"Unknown error" = "ข้อผิดพลาดที่ไม่ทราบสาเหตุ";

/* Unknown error */
"Unknown error while making an identification." = "เกิดข้อผิดพลาดที่ไม่รู้จักขณะทำการระบุตัวตน";

/* message to the user when we get an unknown error. the %ld will be a status code */
"Unknown Error: %ld" = "ข้อผิดพลาดที่ไม่รู้จัก: %ld";

/* Title displayed for a journal post when the post has no title */
"Untitled Post" = "โพสต์ที่ไม่มีชื่อ";

/* Title for progress view when migrating db */
"Updating database..." = "กำลังปรับปรุงฐานข้อมูล...";

/* No comment provided by engineer. */
"Updating..." = "กำลังอัปเดต";

/* accessibility labelf for upload button
   Title for upload button. */
"Upload" = "อัปโหลด";

/* No comment provided by engineer. */
"Upload Error" = "อัปโหลดผิดพลาด";

/* upload failed alert title */
"Upload Failed" = "อัปโหลดล้มเหลว";

/* No comment provided by engineer. */
"Upload this observation to enable comments & identifications." = "อัปโหลดการสังเกตนี้เพื่อเปิดใช้งานความคิดเห็นและการระบุตัวตน";

/* No comment provided by engineer. */
"Upload this observation to enable faves." = "อัปโหลดการสังเกตนี้เพื่อเปิดใช้งานการบันทึก";

/* subtitle for observation while it's uploading. */
"Uploading..." = "กำลังอัปโหลด...";

/* label for username field in settings
   The desired username during signup. */
"Username" = "ชื่อผู้ใช้";

/* users can login with their username or their email address. */
"Username or email" = "ชื่อผู้ใช้หรืออีเมล";

/* Title for version section of settings. */
"Version" = "เวอร์ชัน";

/* label for start video tutorial action in settings. */
"Video Tutorial" = "วีดีโอแนะนำวิธีการใช้งาน";

/* button to view privacy policy */
"View Privacy Policy" = "View Privacy Policy";

/* unknown taxon subtitle when suggestions are available */
"View suggestions" = "ดูคำแนะนำ ";

/* button to view terms of use */
"View Terms of Use" = "View Terms of Use";

/* Subtitle below image for projects tutorial screen. The string is the URL for iNat (or partner site) */
"Visit %@ to create your own projects" = "เยี่ยมชม %@ เพื่อสร้างโครงการของคุณเอง";

/* Subtitle below image for guides tutorial screen */
"Visit iNaturalist.org to create your own guides" = "ไปที่ iNaturalist.org เพื่อสร้างคู่มือของคุณเอง";

/* basis for a species suggestion */
"Visually Similar" = "ภาพที่คล้ายกัน";

/* basis for a species suggestion */
"Visually Similar / Seen Nearby" = "ภาพที่คล้ายกัน / มองเห็นได้ในบริเวณใกล้เคียง";

/* Subtitle for observation when waiting to upload. */
"Waiting to upload..." = "กำลังรออัปโหลด ...";

/* inat ios translators with more than 200 strings contributed, alphabetically */
"We are grateful for the translation assistance provided by the crowdin.com community, especially: Catherine B, Vladimir Belash, cgalindo, danieleseglie, Eduardo Martínez, naofum, Foss, jacquesboivin, Sungmin Ji, katunchik, NCAA, oarazy, sudachi, T.O, testamorta, and vilseskog. To join the iNaturalist iOS translation team, please visit https://crowdin.com/project/inaturalistios." = "เรารู้สึกขอบคุณสำหรับความช่วยเหลือในการแปลโดยชุมชน crowdin.com โดยเฉพาะ: Catherine B, Vladimir Belash, cgalindo, danieleseglie, Eduardo Martínez, naofum, Foss, jacquesboivin, Sungmin Ji, katunchik, NCAA, oarazy, sudachi, TO, testamorta และ vilseskog หากต้องการเข้าร่วมทีมแปล iNaturalist iOS โปรดไปที่ https://crowdin.com/project/inaturalistios";

/* No comment provided by engineer. */
"We don't have permission from iOS to use your location." = "เราไม่ได้รับอนุญาตจาก iOS ให้ใช้ตำแหน่งของคุณ";

/* Alert text for the personal information checkbox during create account. */
"We store personal information like usernames and email addresses in order to manage accounts on this site, and to comply with privacy laws, we need you to check this box to indicate that you consent to this use of personal information. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account." = "We store personal information like usernames and email addresses in order to manage accounts on this site, and to comply with privacy laws, we need you to check this box to indicate that you consent to this use of personal information. To learn more about what information we collect and how we use it, please see our Privacy Policy and our Terms of Use. There is no way to have an iNaturalist account without storing personal information, so the only way to revoke this consent is to delete your account.";

/* base error message when icloud photo fetch fails */
"We're not able to fetch your photo from iCloud: %@" = "เราไม่สามารถดึงรูปภาพของคุณจาก iCloud: %@";

/* No comment provided by engineer. */
"We're not confident enough to make a recommendation, but here are our top suggestions." = "เราไม่มั่นใจพอที่จะให้คำแนะนำ แต่นี่คือคำแนะนำยอดนิยมของเรา";

/* No comment provided by engineer. */
"We're not confident enough to make a recommendation." = "We're not confident enough to make a recommendation.";

/* comment for common ancestor suggestion. %1$@ is the rank name (order, family), whereas %2$@ is the actual rank (Animalia, Insecta) */
"We're pretty sure this is in the %1$@ %2$@." = "เราค่อนข้างแน่ใจว่านี่อยู่ในไฟล์ %1$@ %2$@.";

/* unknown taxon title */
"What did you see?" = "คุณเห็นอะไร?";

/* title for alert explaining what captive means */
"What does captive / cultivated mean?" = "การเพาะเลี้ยง / เพาะปลูกหมายถึงอะไร?";

/* No comment provided by engineer. */
"Which organism?" = "สิ่งมีชีวิตใด?";

/* No comment provided by engineer. */
"Which person?" = "คนไหน?";

/* No comment provided by engineer. */
"Which place?" = "สถานที่ใด?";

/* No comment provided by engineer. */
"Which project?" = "โครงการไหน?";

/* No comment provided by engineer. */
"Whoops" = "อุปส์!";

/* Default upload failure alert title. */
"Whoops!" = "ขออภัย!";

/* No comment provided by engineer. */
"Without a date, this observation may be very hard for others to identify accurately, and will never attain research grade." = "หากไม่มีวันที่ของการสังเกตนี้อาจเป็นเรื่องยากสำหรับคนอื่นที่จะระบุได้อย่างถูกต้องและข้อมูลจะไม่ได้ระดับการวิจัย";

/* No comment provided by engineer. */
"Without a location, this observation will be very hard for others to identify and will never attain research grade." = "หากไม่มีสถานที่ตั้งการสังเกตนี้จะยากมากสำหรับผู้อื่นในการระบุและข้อมูลจะไม่ได้ระดับการวิจัย";

/* No comment provided by engineer. */
"Without at least one photo or sound, this observation will be impossible for others to help identify." = "หากไม่มีภาพถ่ายหรือเสียงอย่างน้อยหนึ่งภาพการสังเกตนี้จะเป็นไปไม่ได้ที่ผู้อื่นจะช่วยระบุได้";

/* message for alert when db migration has a problem */
"Would you like to share your migration report with help@inaturalist.org for debugging?" = "คุณต้องการแบ่งปันรายงานการย้ายข้อมูลของคุณกับ help@inaturalist.org เพื่อแก้ไขข้อบกพร่องหรือไม่";

/* positive response to binary choice, yes or no */
"Yes" = "ใช่";

/* change network partner button */
"Yes, change my affiliation" = "ใช่เปลี่ยนสังกัดของฉัน";

/* No comment provided by engineer. */
"Yes, delete this observation" = "ใช่ลบการสังเกตนี้";

/* cc licensing consent checkbox label */
"Yes, license my content so scientists can use my data. Learn More" = "ใช่อนุญาตเนื้อหาของฉันเพื่อให้นักวิทยาศาสตร์ใช้ข้อมูลของฉันได้ เรียนรู้เพิ่มเติม";

/* failure message when the user tries to change their network affiliation too often */
"You can only change your network affiliation once per day." = "คุณสามารถเปลี่ยนการเชื่อมโยงเครือข่ายของคุณได้วันละครั้งเท่านั้น";

/* 403 forbidden message */
"You don't have permission to do that. Your account may have been suspended. Please contact help@inaturalist.org" = "คุณไม่ได้รับอนุญาตให้ทำเช่นนั้น บัญชีของคุณอาจถูกระงับ กรุณาติดต่อ help@inaturalist.org";

/* 403 forbidden message */
"You don't have permission to do that. Your account may have been suspended. Please contact help@inaturalist.org." = "คุณไม่ได้รับอนุญาตให้ทำเช่นนั้น บัญชีของคุณอาจถูกระงับ กรุณาติดต่อ help@inaturalist.org";

/* No comment provided by engineer. */
"You must be connected to the Internet to do this." = "คุณต้องเชื่อมต่อกับอินเทอร์เน็ตเพื่อทำสิ่งนี้";

/* No comment provided by engineer. */
"You must be connected to the Internet to upload to iNaturalist.org" = "คุณต้องเชื่อมต่อกับอินเทอร์เน็ตเพื่ออัปโหลดไปยัง iNaturalist.org";

/* No comment provided by engineer. */
"You must be logged in to access projects." = "คุณต้องเข้าสู่ระบบเพื่อเข้าถึงโปรเจ็กต์";

/* Unspecific signup prompt reason. */
"You must be logged in to do that." = "คุณต้องเข้าสู่ระบบเพื่อดำเนินการต่อ";

/* Signup prompt reason when user tries to sync user projects. */
"You must be logged in to sync user projects." = "คุณต้องเข้าสู่ระบบเพื่อซิงค์โครงการของผู้ใช้";

/* This is an explanation for why the upload button triggers a login prompt. */
"You must be logged in to upload." = "คุณต้องเข้าสู่ระบบเพื่ออัปโหลด";

/* No comment provided by engineer. */
"You must be logged in!" = "คุณต้องเข้าสู่ระบบ!";

/* Account is required error message */
"You must be logged in." = "คุณต้องเข้าสู่ระบบ";

/* Reason text for signup prompt while trying to join a project. */
"You must be signed in to join a project." = "คุณต้องลงชื่อเข้าใช้เพื่อเข้าร่วมโครงการ";

/* 401 unauthorized message */
"You need to log in to do that." = "คุณต้องเข้าสู่ระบบเพื่อดำเนินการดังกล่าว";

/* No comment provided by engineer. */
"You will receive updates once you've uploaded observations." = "คุณจะได้รับการอัปเดตเมื่อคุณอัปโหลดการสังเกต";

/* Title for account section of settings. */
"Your Account" = "บัญชีของคุณ";

/* No comment provided by engineer. */
"Your Guides" = "คำแนะนำของคุณ";

/* Placeholder for free text observation field value */
"Your response here" = "การตอบของคุณที่นี่";
